Revit 2027 API
ElementParameterFilter Constructor
Overload List
Name | Description
ElementParameterFilter(FilterRule) |  Constructs a new instance of an ElementParameterFilter from a single rule.
ElementParameterFilter(IList<FilterRule>) |  Constructs a new instance of an ElementParameterFilter from a set of rules.
ElementParameterFilter(FilterRule, Boolean) |  Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule.
ElementParameterFilter(IList<FilterRule>, Boolean) |  Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing the given filter rules.
Top
See Also
Reference
ElementParameterFilter Class
Autodesk.Revit.DB Namespace